openFOAM_Simple/cylinder/template/cylinderAndBackground/0.orig/include/initialConditions
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1806                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

flowVelocity         (FVEL 0 0);
pressure             PRESS;
turbulentKE          TKE;
turbulentEpsilon     TEPS;

// ************************************************************************* //
