openFOAM_Simple/cylinder/template/cylinderAndBackground/Allrun
#!/bin/sh
cd ${0%/*} || exit 1                        # Run from this directory
. $WM_PROJECT_DIR/bin/tools/RunFunctions    # Tutorial run functions

./Allrun.pre

# Run it for a bit
runApplication $(getApplication)

#------------------------------------------------------------------------------
